app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-06-28 00:12:44.878638"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(params.require(:first_name).permit(:last_name, :last_name))